Revit 2015 API
BoundingBoxXYZ Members
The BoundingBoxXYZ type exposes the following members.
Constructors
Name | Description
BoundingBoxXYZ
Initializes a new instance of the BoundingBoxXYZ class
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BoundEnabled
Indexed access for loops.
Bounds
Indexed access for loops. Use 0 for Min and 1 for Max.
Enabled
Defines whether bounding box is turned on.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Max
Maximum coordinates (upper-right-front corner of the box).
MaxEnabled
Defines whether the maximum bound is active for given dimension.
Min
Minimum coordinates (lower-left-rear corner of the box).
MinEnabled
Defines whether the minimum bound is active for given dimension.
Transform
The transform FROM the coordinate space of the box TO the model space.
See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace